tutorials/incompressible/pimpleDyMFoam/oscillatingInletACMI2D/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.8e-3;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
    ACMI2_blockage
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
}


// ************************************************************************* //
